Ran Plan for 3 projects:

1. project: `apps-staging` dir: `4.apps` workspace: `staging`
1. project: `apps-prod` dir: `4.apps` workspace: `prod`
1. project: `platform` dir: `2.platform` workspace: `default`

### 1. project: `apps-staging` dir: `4.apps` workspace: `staging`
<details><summary>Show Output</summary>

```diff
infra-flash-commit:f1977e4 

Backend config changed or missing. Reinitializing...


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # kubectl_manifest.kubero_instance will be updated in-place
~ resource "kubectl_manifest" "kubero_instance" {
        id                      = "/apis/application.kubero.dev/v1alpha1/namespaces/kubero-staging/kuberos/kubero"
        name                    = "kubero"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: application.kubero.dev/v1alpha1
            kind: Kubero
            metadata:
          +   annotations:
          +     vault.hashicorp.com/agent-inject: "true"
          +     vault.hashicorp.com/agent-inject-secret-env: secret/data/data/kubero
          +     vault.hashicorp.com/agent-inject-template-env: |
          +       {{- with secret "secret/data/data/kubero" -}}
          +       export KUBERO_WEBHOOK_SECRET="{{ .Data.data.KUBERO_WEBHOOK_SECRET }}"
          +       export KUBERO_SESSION_KEY="{{ .Data.data.KUBERO_SESSION_KEY }}"
          +       {{- end -}}
          +     vault.hashicorp.com/role: kubero
              name: kubero
              namespace: kubero-staging
            spec:
              image:
                pullPolicy: IfNotPresent
                repository: ghcr.io/kubero-dev/kubero/kubero
                tag: latest
              ingress:
                annotations:
                  cert-manager.io/cluster-issuer: letsencrypt-prod
                  traefik.ingress.kubernetes.io/router.middlewares: platform-portal-auth@kubernetescrd
                className: traefik
                enabled: true
                hosts:
                - host: kcloud.zitian.party
                  paths:
                  - path: /
                    pathType: Prefix
                tls:
                - hosts:
                  - kcloud.zitian.party
                  secretName: kubero-ui-tls
              kubero:
                auth:
                  github:
                    enabled: false
                config:
                  clusterissuer: letsencrypt-prod
                  kubero:
                    admin:
                      disabled: false
                    readonly: false
                context: inClusterContext
                database:
                  accessModes:
                  - ReadWriteOnce
                  size: 1Gi
                  storageClassName: local-path
                namespace: kubero-staging
          -     sessionKey: 7b9f39df5cf61ddacb359f62fb51a624629e7daf629b61b3511d6ef0b4434efc
          +     sessionKey: 6737ace02819c12d926ac8bfe08dde475c8283fe21640a562735802628e1fdc7
              livenessProbe:
                httpGet:
                  path: /
                  port: 2000
                initialDelaySeconds: 30
                periodSeconds: 10
              readinessProbe:
                httpGet:
                  path: /
                  port: 2000
                initialDelaySeconds: 5
                periodSeconds: 5
              replicaCount: 1
              service:
                port: 2000
                type: ClusterIP
        EOT
        # (14 unchanged attributes hidden)
    }

  # kubernetes_service_account.kubero will be created
+ resource "kubernetes_service_account" "kubero" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "kubero"
          + namespace        = "kubero-staging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # random_id.kubero_session_secret will be destroyed
  # (because random_id.kubero_session_secret is not in configuration)
- resource "random_id" "kubero_session_secret" {
      - b64_std     = "e58531z2HdrLNZ9i+1GmJGKefa9im2GzUR1u8LRDTvw=" -> null
      - b64_url     = "e58531z2HdrLNZ9i-1GmJGKefa9im2GzUR1u8LRDTvw" -> null
      - byte_length = 32 -> null
      - dec         = "55915808480441380053427832712491152012099215374657984171750255703449988714236" -> null
      - hex         = "7b9f39df5cf61ddacb359f62fb51a624629e7daf629b61b3511d6ef0b4434efc" -> null
      - id          = "e58531z2HdrLNZ9i-1GmJGKefa9im2GzUR1u8LRDTvw" -> null
    }

  # random_id.kubero_webhook_secret will be destroyed
  # (because random_id.kubero_webhook_secret is not in configuration)
- resource "random_id" "kubero_webhook_secret" {
      - b64_std     = "9sKuCAsCGSgNc9r2y0Ng9fHbWEZ+a0CX0Fv3vjK8+p8=" -> null
      - b64_url     = "9sKuCAsCGSgNc9r2y0Ng9fHbWEZ-a0CX0Fv3vjK8-p8" -> null
      - byte_length = 32 -> null
      - dec         = "111612930202753751380578856482081899563019285496294477810649772987267428448927" -> null
      - hex         = "f6c2ae080b0219280d73daf6cb4360f5f1db58467e6b4097d05bf7be32bcfa9f" -> null
      - id          = "9sKuCAsCGSgNc9r2y0Ng9fHbWEZ-a0CX0Fv3vjK8-p8" -> null
    }

Plan: 1 to add, 1 to change, 2 to destroy.

Changes to Outputs:
~ kubero_session_secret = (sensitive value)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p apps-staging`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F4.apps%252Fstaging)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p apps-staging`
</details>
Plan: 1 to add, 1 to change, 2 to destroy.

---
### 2. project: `apps-prod` dir: `4.apps` workspace: `prod`
<details><summary>Show Output</summary>

```diff
infra-flash-commit:f1977e4 

Backend config changed or missing. Reinitializing...


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # kubectl_manifest.kubero_instance will be updated in-place
~ resource "kubectl_manifest" "kubero_instance" {
        id                      = "/apis/application.kubero.dev/v1alpha1/namespaces/kubero-prod/kuberos/kubero"
        name                    = "kubero"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: application.kubero.dev/v1alpha1
            kind: Kubero
            metadata:
          +   annotations:
          +     vault.hashicorp.com/agent-inject: "true"
          +     vault.hashicorp.com/agent-inject-secret-env: secret/data/data/kubero
          +     vault.hashicorp.com/agent-inject-template-env: |
          +       {{- with secret "secret/data/data/kubero" -}}
          +       export KUBERO_WEBHOOK_SECRET="{{ .Data.data.KUBERO_WEBHOOK_SECRET }}"
          +       export KUBERO_SESSION_KEY="{{ .Data.data.KUBERO_SESSION_KEY }}"
          +       {{- end -}}
          +     vault.hashicorp.com/role: kubero
              name: kubero
              namespace: kubero-prod
            spec:
              image:
                pullPolicy: IfNotPresent
                repository: ghcr.io/kubero-dev/kubero/kubero
                tag: latest
              ingress:
                annotations:
                  cert-manager.io/cluster-issuer: letsencrypt-prod
                  traefik.ingress.kubernetes.io/router.middlewares: platform-portal-auth@kubernetescrd
                className: traefik
                enabled: true
                hosts:
                - host: kcloud.zitian.party
                  paths:
                  - path: /
                    pathType: Prefix
                tls:
                - hosts:
                  - kcloud.zitian.party
                  secretName: kubero-ui-tls
              kubero:
                auth:
                  github:
                    enabled: false
                config:
                  clusterissuer: letsencrypt-prod
                  kubero:
                    admin:
                      disabled: false
                    readonly: false
                context: inClusterContext
                database:
                  accessModes:
                  - ReadWriteOnce
                  size: 1Gi
                  storageClassName: local-path
                namespace: kubero-prod
          -     sessionKey: 35d5a06a8c6a4cf6ff8dd4b6e7f1eb5b432c4cd5abaa14d1a46272796de476d8
          +     sessionKey: 6737ace02819c12d926ac8bfe08dde475c8283fe21640a562735802628e1fdc7
              livenessProbe:
                httpGet:
                  path: /
                  port: 2000
                initialDelaySeconds: 30
                periodSeconds: 10
              readinessProbe:
                httpGet:
                  path: /
                  port: 2000
                initialDelaySeconds: 5
                periodSeconds: 5
              replicaCount: 1
              service:
                port: 2000
                type: ClusterIP
        EOT
        # (14 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[45] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-manager-rolebinding"
        name                    = "kubero-operator-manager-rolebinding"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[46] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-proxy-rolebinding"
        name                    = "kubero-operator-proxy-rolebinding"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

  # kubernetes_service_account.kubero will be created
+ resource "kubernetes_service_account" "kubero" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "kubero"
          + namespace        = "kubero-prod"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # random_id.kubero_session_secret will be destroyed
  # (because random_id.kubero_session_secret is not in configuration)
- resource "random_id" "kubero_session_secret" {
      - b64_std     = "NdWgaoxqTPb/jdS25/HrW0MsTNWrqhTRpGJyeW3kdtg=" -> null
      - b64_url     = "NdWgaoxqTPb_jdS25_HrW0MsTNWrqhTRpGJyeW3kdtg" -> null
      - byte_length = 32 -> null
      - dec         = "24350026551668198036252805849210801521295822642600300536474453927682342418136" -> null
      - hex         = "35d5a06a8c6a4cf6ff8dd4b6e7f1eb5b432c4cd5abaa14d1a46272796de476d8" -> null
      - id          = "NdWgaoxqTPb_jdS25_HrW0MsTNWrqhTRpGJyeW3kdtg" -> null
    }

  # random_id.kubero_webhook_secret will be destroyed
  # (because random_id.kubero_webhook_secret is not in configuration)
- resource "random_id" "kubero_webhook_secret" {
      - b64_std     = "w0EKnk5oPdYz6+ieLLPvT2G5JCIYSMxAWhtB1ggqU0U=" -> null
      - b64_url     = "w0EKnk5oPdYz6-ieLLPvT2G5JCIYSMxAWhtB1ggqU0U" -> null
      - byte_length = 32 -> null
      - dec         = "88315923818339823266091482492552659792063963189436465343726723073344562418501" -> null
      - hex         = "c3410a9e4e683dd633ebe89e2cb3ef4f61b924221848cc405a1b41d6082a5345" -> null
      - id          = "w0EKnk5oPdYz6-ieLLPvT2G5JCIYSMxAWhtB1ggqU0U" -> null
    }

Plan: 1 to add, 3 to change, 2 to destroy.

Changes to Outputs:
~ kubero_session_secret = (sensitive value)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p apps-prod`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F4.apps%252Fprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p apps-prod`
</details>
Plan: 1 to add, 3 to change, 2 to destroy.

---
### 3. project: `platform` dir: `2.platform` workspace: `default`
<details><summary>Show Output</summary>

```diff
infra-flash-commit:f1977e4 

Backend config changed or missing. Reinitializing...


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.http.casdoor_oidc_discovery[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "http" "casdoor_oidc_discovery" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + request_headers      = {
          + "Accept" = "application/json"
        }
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = "https://sso.zitian.party/.well-known/openid-configuration"
    }

  # restapi_object.app_dashboard_oidc[0] will be created
+ resource "restapi_object" "app_dashboard_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/api/add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/api/delete-application"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/api/add-application"
      + read_path       = "/api/get-application?id=admin"
      + update_path     = "/api/update-application"
    }

  # restapi_object.app_kubero_oidc[0] will be created
+ resource "restapi_object" "app_kubero_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/api/add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/api/delete-application"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/api/add-application"
      + read_path       = "/api/get-application?id=admin"
      + update_path     = "/api/update-application"
    }

  # restapi_object.app_portal_gate[0] will be created
+ resource "restapi_object" "app_portal_gate" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/api/add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/api/delete-application"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/api/add-application"
      + read_path       = "/api/get-application?id=admin"
      + update_path     = "/api/update-application"
    }

  # restapi_object.app_vault_oidc[0] will be created
+ resource "restapi_object" "app_vault_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/api/add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/api/delete-application"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/api/add-application"
      + read_path       = "/api/get-application?id=admin"
      + update_path     = "/api/update-application"
    }

  # restapi_object.provider_github[0] will be updated in-place
~ resource "restapi_object" "provider_github" {
      + create_path  = "/api/add-provider"
      ~ data         = (sensitive value)
      - debug        = true -> null
      + destroy_path = "/api/delete-provider"
        id           = "GitHub"
      + id_attribute = "name"
      ~ path         = "/api/get-provider?id=admin" -> "/api/add-provider"
      + read_path    = "/api/get-provider?id=admin"
      + update_path  = "/api/update-provider"
        # (2 unchanged attributes hidden)
    }

  # vault_jwt_auth_backend.oidc[0] will be created
+ resource "vault_jwt_auth_backend" "oidc" {
      + accessor           = (known after apply)
      + default_role       = "reader"
      + description        = "OIDC backend for Casdoor"
      + disable_remount    = false
      + id                 = (known after apply)
      + local              = false
      + namespace_in_state = true
      + oidc_client_id     = "vault-oidc"
      + oidc_client_secret = (sensitive value)
      + oidc_discovery_url = "https://sso.zitian.party"
      + path               = "oidc"
      + tune               = [
          + {
              + allowed_response_headers     = []
              + audit_non_hmac_request_keys  = []
              + audit_non_hmac_response_keys = []
              + default_lease_ttl            = "1h"
              + listing_visibility           = ""
              + max_lease_ttl                = "8h"
              + passthrough_request_headers  = []
              + token_type                   = "default-service"
            },
        ]
      + type               = "oidc"
    }

  # vault_jwt_auth_backend_role.reader[0] will be created
+ resource "vault_jwt_auth_backend_role" "reader" {
      + allowed_redirect_uris        = [
          + "http://localhost:8250/oidc/callback",
          + "https://secrets.zitian.party/ui/vault/auth/oidc/oidc/callback",
        ]
      + backend                      = "oidc"
      + bound_audiences              = [
          + "vault-oidc",
        ]
      + bound_claims_type            = (known after apply)
      + clock_skew_leeway            = 0
      + disable_bound_claims_parsing = false
      + expiration_leeway            = 0
      + id                           = (known after apply)
      + not_before_leeway            = 0
      + oidc_scopes                  = [
          + "email",
          + "openid",
          + "profile",
        ]
      + role_name                    = "reader"
      + role_type                    = "oidc"
      + token_policies               = [
          + "reader",
        ]
      + token_ttl                    = 3600
      + token_type                   = "default"
      + user_claim                   = "sub"
      + user_claim_json_pointer      = false
      + verbose_oidc_logging         = true
    }

Plan: 6 to add, 1 to change, 0 to destroy.

Changes to Outputs:
~ sso_e2e_status                 = {
      ~ oidc_discovery = "disabled" -> (known after apply)
      ~ portal_auth    = "disabled" -> "200"
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>
Plan: 6 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`